Revit 2027 API
Element.RefersToExternalResourceReferences Method
 Determines whether this Element uses external resources.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RefersToExternalResourceReferences()
Public Function RefersToExternalResourceReferences As Boolean
public:
bool RefersToExternalResourceReferences()
member RefersToExternalResourceReferences : unit -> bool
Return Value
Boolean
 True if this element uses external resources, false if it does not.
Remarks
 Some elements may contain references to data from external resources. These elements contain one or more ExternalResourceReferences.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace